import sys
import asyncio
from modules.simplifier import detect_subject

text = """
समाज का अध्ययन : भारत और उसके आगे | कक्षा 8, भाग 1
प्राकृतिक संसाधन एवं उनका उपयोग
अध्याय 1
समस्त चिंतनशील सामाजिक विज्ञानी इस बात पर स्पष्ट हैं कि हमें क्या करने की आवश्यकता है। हमें संपोषणीय अर्थव्यवस्था की ओर बढ़ना होगा, एक ऐसी अर्थव्यवस्था जो प्रकृति के साथ सामंजस्य स्थापित करते हुए कार्य करे, प्रयुक्त संसाधनों का पुनरुपयोग करे, अपशिष्ट को न्यूनतम करे तथा समाप्त हो चुके संसाधनों की पुन: पूर्ति करे। हमें प्रकृति के सहज ज्ञान की ओर लौटना होगा जो सभी संसाधनों का अंततः पुनर्निर्माणकर्ता एवं पुनर्चक्रणकर्ता है।
1. हम प्राकृतिक संसाधनों का वर्गीकरण कैसे करते हैं?
"""

res = detect_subject(text)
import json
with open("result.json", "w", encoding="utf-8") as f:
    json.dump(res, f, ensure_ascii=False)
